<%@ page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>
<%@ include file="include/page.jsp"%>
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>法律声明</title>
<jsp:include page="include/script.jsp"></jsp:include>
 
</head>
<body class="pagelegel">
	<jsp:include page="include/head.jsp"></jsp:include>

<section class="legel">
    <div class="sub_coll">
        <p class="position">首页>联系我们>法律声明</p>
    </div>
    <div class="content clearfix">
        <div class="con-tab">
            <ul class="con-left clearfix" id="con-left">
                <li class="legel-bo" style="cursor: pointer;">法律声明</li>
                <li style="cursor: pointer;">免责声明</li>
            </ul>
            <div class="kongb">
            </div>
        </div>
        <div  class="wrap">
            <div class="active">
                <h2 class="shengm">法律声明</h2>
                <div class="wrap-content wrapcon">
                    <p>若要访问和使用本智汇宝支付网站，为了您安全使用智汇宝服务并减少交易风险，您必须不加修改地完全接受本网站协议中所包含的条款、条件和本网站即时刊登的通告，并且遵守有关互联网、万维网及/或本网站的相关法律、规定与规则。一旦您访问并使用了本网站，即表示您同意并接受了所有该等条款、条件及通告。</p>
                    <p>（一）本网站上的信息</p>
                    <p> 本智汇宝支付网站上关于智汇宝会员或他们的产品（包括但不限于公司名称、联系人及联络信息，产品的描述和说明，相关图片、视讯等）的信息均由会员自行提供，会员依法应对其提供的任何信息承担全部责任。智汇宝对此等信息的准确性、完整性、合法性或真实性均不承担任何责任。此外，智汇宝对任何使用或提供本网站信息的商业活动及其风险不承担任何责任。</p>
                    <p> 浏览者可以下载本网站上显示的资料，但这些资料只限用于个人学习研究使用，不得用于任何商业用途，无论是否在资料上明示，所有此等资料都是受到版权法的法律保护。浏览者没有获得智汇宝或各自的版权所有者明确的书面同意下，不得分发、修改、散布、再使用、再传递或使用本网站的内容用于任何公众商业用途。</p>
                    <p>（二）知识产权</p>
                    <p>本智汇宝支付网站归重庆市缤虎网络科技有限公司所有。所有的相关知识产权均在全世界范围内受到法律保护，除非有其他的标注或在此等条款和规则中被允许使用，本网站上可阅读和可见的所有资料都受到知识产权法的保护。</p>
                    <p>"智汇宝"和智汇宝LOGO标识均属重庆市缤虎网络科技有限公司的商品及服务商标和商号，所有其他智汇宝公司没有主张权利的商标和产品名称则可能是它们各自所有权人的商标或注册商标。未获得智汇宝或其他在本网站上有权使用商标的第三方的书面同意下，不应理解为本网站授权使用被展示于本网站的任何商标。</p>
                    <p>本智汇宝支付网站为客户提供服务的所有相关技术均属于重庆市缤虎网络科技有限公司所有，对具备国际创新性和先进性的技术已向国家知识产权局申请专利权的保护，提请注意的是，无论是否属于专利技术，智汇宝均有权对任何侵犯技术专有权的行为进行法律上的追究。</p>
                </div>


            </div>

           <div class="" style="padding-bottom:32px;">
                    <h2 class="shengm">免责声明</h2>
                    <div class="wrap-content">
                        <p>（一）特别声明</p>
                        <p>本公司在此特别声明对如下事宜不承担任何法律责任：</p>
                        <p>（1） 智汇宝在此声明，对您使用网站、与本网站相关的任何内容、服务或其它链接至本网站的站点、内容均不作任何保证。</p>
                        <p>（2） 无论在任何原因下（包括但不限于疏忽原因），对您或任何人通过使用本网站上的信息或由本网站链接的信息，或其他与本网站链接的网站信息所导致的损失或损害（包括直接、间接、特别或后果性的损失或损害，例如收入或利润之损失，电脑系统之损坏或数据丢失等后果），责任均由使用者自行承担。
使用者对本网站的使用即表明同意承担浏览本网站的全部风险，智汇宝对使用者在本网站存取资料所导致的任何直接的、间接的损失不承担任何责任。</p>
                        <p>（二）本服务只为用户的交易提供支付平台，并不实际参与交易，本服务对用户间的交易（包括但不限于交易物品的质量、数量、功能；交易物品、方式的合法性；交易物品的转移；交易发票的开具）不承担任何风险、责任、损失和费用。</p>
                        <p>（三）由于下列原因，使您无法使用本服务或造成您损失的，智汇宝将不承担任何责任：（1）智汇宝预先通知的系统停机维护期间；</p>
                        <p>（2）银行设备或电信设备等非智汇宝原因导致发生的错误、中断、延迟或不能传递；（3）战争、罢工、洪水、地震、台风、海啸、停电、电脑黑客等不可抗力。</p>
                        <p>（四）鉴于目前电子商务的软硬件环境尚未成熟，且有关安全保护技术和措施在其本身不断得到改进和完善的同时，也在不断面临新的挑战。因此，您使用本服务将存在一定的风险，该等风险包括但不限于：您的用户账号和密码被他人冒用、盗用、非法使用；或不法分子盗用您的银行卡；或对方拒绝付款。这些风险均会给您造成经济损失，除非可证明智汇宝对损失的形成存在故意或重大过失，智汇宝将不承担任何责任。</p>
                       <p>（五）用户同意使智汇宝（包括但不限于智汇宝的关联公司、董事、代理人和雇员）免受用户间纠纷的损害，包括但不限于任何索赔、要求、诉讼、损失和损害。</p>
                       <p>（六）智汇宝以正常且合理的谨慎原则提供本协议项下的服务，而不带有任何保证或条件，无论是明示、默示或法定的。在法律准许的范围内，智汇宝、智汇宝的关联公司、董事、代理人和雇员特别否定任何有关所有权、适销性、特定目的之适用性和不侵权的默示保证。此外，由于本网站的服务和经营可能受智汇宝无法控制的多种外部因素影响，智汇宝不就服务的时限作出保证。</p>
                       <p>（七）智汇宝、智汇宝的关联公司、代理人和雇员在任何情况下均不就因智汇宝的网站、智汇宝的服务或本协议而产生或与之有关的利润损失或任何直接或间接的损害承担任何责任。</p>
                       <p>（八）在任何情况下，智汇宝、智汇宝的关联公司、代理人和雇员不承担用户和任何第三方之间的任何责任。</p>
                       <p>（九）用户同意就任何第三方提出的，由于用户违反本协议或本网站的其他条款和规则或违反任何法律或第三方的权利而产生或引起的任何索赔、要求（包括合理的律师费），对智汇宝、智汇宝的关联公司、董事、代理人和雇员进行补偿并使其免受损害。</p>
                    </div>


                </div>
        </div>


    </div>

</section>
	<jsp:include page="include/feet.jsp"></jsp:include>

<script>
	require('modules/widget/header/header');
  	require('modules/widget/footer/footer');

    var $ = require('components/jquery/jquery');
    $(function(){
        function tab(pa){
            $(pa+".con-left>li").click(function(){
                //找到是点击第几个
                var index=$(pa+".con-left>li").index($(this));
//                alert(index);
                //以前显示的隐藏
                $(pa+".wrap>div:visible").hide();
                //第几个显示
                $(pa+".wrap>div:eq("+index+")").show();

                $(pa+".con-left>li.legel-bo").removeClass("legel-bo");

                $(this).addClass("legel-bo");
            })//clicked
        }//tab ed
        tab(".content ");
    })
</script>
</body>
</html>