function setcity(opn_bnk_prov,opn_bnk_city) {
    var val_bnk_pro_nm = document.getElementById(opn_bnk_prov).value;
    switch (val_bnk_pro_nm) {
        case "" :
            var cityOptions = new Array("");
            break;
        case "01" :
            var cityOptions = new Array(
				//北京
				"北京市:100"
			);
            break;
		    case "02" :
            var cityOptions = new Array(
				//天津
				"天津市:220" 
			);
            break;
		    case "03" :
            var cityOptions = new Array(
				//河北
    		    "石家庄:311",
    		    "唐山市:315",
    		    "秦皇岛市:335",
    			  "邯郸市:310",
	    			"邢台市:319",
	    			"保定市:312",
	    			"张家口市:313",
	    			"承德市:314",
	    			"沧州市:317",
	    			"廊坊市:316",
	    			"衡水市:318"
			);
            break;
		case "04" :
            var cityOptions = new Array(
    			//山西 
   				 "太原市:351",
   				 "大同市:352",
   				 "阳泉市:353",
   				 "长治市:355",
   				 "晋城市:356",
   				 "朔州市:349",
   				 "忻州市:350",
   				 "吕梁市:358",
   				 "晋中市:354",
   				 "临汾市:357",
   				 "运城市:359"
			);
            break;
		case "05" :
            var cityOptions = new Array(
    				//内蒙古
    				"呼和浩特市:471",
    				"包头市:472",
    				"乌海市:473",
    				"赤峰市:476",
    				"兴安盟:1980",
    				"通辽市:475",
    				"乌兰浩特:482",
    				"鄂尔多斯市:477",
    				"锡林浩特:479",
    				"阿拉善盟阿左旗:483",
    				"海拉尔:470",
    				"集宁:474",
    				"临河:478"			
			);
            break;
		case "06" :
            var cityOptions = new Array(
    			    //辽宁
    				"沈阳市:240",
    				"大连市:411",
    				"鞍山市:412",
    				"抚顺市:413",
    				"本溪市:414",
    				"丹东市:415",
    				"锦州市:416",
    				"葫芦岛市:429",
    				"营口市:417",
    				"阜新市:418",
    				"辽阳市:419",
    				"盘锦市:427",
    				"铁岭市:410",
    				"朝阳市:421"							
			);
            break;
		case "07" :
            var cityOptions = new Array(
    			    //吉林
    				"长春市:431",
    				"吉林市:432",
    			  "四平市:434",
    				"辽源市:437",
            "通化市:435",
    				"白山市:439",
    				"白城市:436",
    				"延吉:433",
    				"松原市:438",
    				"梅河口:435",
    				"珲春:433"
			);
            break;
		case "08" :
            var cityOptions = new Array(
    			    //黑龙江
    				"哈尔滨市:451",
    				"齐齐哈尔市:452",
    				"大庆市:459",
    				"鸡西市:453",
    				"鹤岗市:454",
    				"双鸭山市:454",
    				"佳木斯市:454",
    				"伊春市:458",
    				"牡丹江市:453",
    				"七台河市:453",
    				"绥化市:458",
            "黑河市:456",
    				"大兴安岭地区:456",
    				"阿城:450"				
			);
            break;
		case "09" :
            var cityOptions = new Array(
    			    //上海
    				"上海市:210"
			);
            break;
		case "10" :
            var cityOptions = new Array(
    			    //江苏
    				"南京市:250",
    				"无锡市:510",
    				"徐州市:516",
    				"常州市:519",
    				"常熟市:520",
    				"苏州市:512",
    				"南通市:513",
    				"连云港市:518",
    				"淮安市:517",
    				"宿迁市:527",
    				"盐城市:515",
    				"扬州市:514",
    				"泰州市:523",
    				"镇江市:511"			
			);
            break;
		case "11" :
            var cityOptions = new Array(
    			    //浙江
    				"杭州市:571",
    				"宁波市:574",
    				"温州市:577",
    				"嘉兴市:573",
    				"湖州市:572",
    				"绍兴市:575",
    				"金华市:579",
    				"衢州市:570",
    				"舟山市:580",
    				"丽水市:578",
    				"台州市:576"					
			);
            break;
		case "12" :
            var cityOptions = new Array(
    			    //安徽
    				"合肥市:551",
    				"芜湖市:553",
    				"蚌埠市:552",
    				"淮南市:554",
    				"马鞍山市:555",
    				"淮北市:561",
    				"铜陵市:562",
    				"安庆市:556",
    				"黄山市:559",
    				"阜阳市:558",
    				"亳州市:558",
    				"宿州市:557",
    				"滁州市:550",
    				"六安市:564",
    				"宣城市:563",
    				"巢湖市:565",
    				"池州市:566"						
			);
            break;
		case "13" :
            var cityOptions = new Array(
    			    //福建
    				"福州市:591",
    				"厦门市:592",
    				"莆田市:594",
    				"三明市:598",
    				"泉州市:595",
    				"漳州市:596",
    				"南平市:599",
    				"宁德市:593",
    				"龙岩市:597"				
			);
            break;
		case "14" :
            var cityOptions = new Array(
    			    //江西
    				"南昌市:791",
    				"景德镇市:798",
    				"萍乡市:799",
    				"九江市:792",
    				"新余市:790",
    				"鹰潭市:701",
    				"赣州市:797",
    				"宜春市:795",
    				"上饶市:793",
    				"吉安市:796",
    				"抚州市:794"
			);
            break;
		case "15" :
            var cityOptions = new Array(
    			    //山东
    				"济南市:531",
    				"青岛市:532",
    				"淄博市:533",
    				"枣庄市:632",
    				"东营市:546",
    				"烟台市:535",
    				"潍坊市:536",
    				"济宁市:537",
    				"泰安市:538",
    				"莱芜市:634",
    				"威海市:631",
    				"滨州市:543",
    				"德州市:534",
    				"聊城市:635",
    				"临沂市:539",
    				"日照市:633",
    				"菏泽市:530"
			);
            break;
		case "16" :
            var cityOptions = new Array(
    			    //河南
    				"郑州市:371",
    				"开封市:378",
    				"洛阳市:379",
    				"平顶山市:375",
    				"安阳市:372",
    				"鹤壁市:392",
    				"新乡市:373",
    				"焦作市:391",
    				"濮阳市:393",
    				"许昌市:374",
    				"漯河市:395",
    				"三门峡市:398",
    				"商丘市:370",
    				"周口市:394",
    				"驻马店市:396",
    				"南阳市:377",
    				"信阳市:376",
    				"潢川市:376"	
			);
            break;
		case "17" :
            var cityOptions = new Array(
    			    //湖北
    				"武汉市:270",
    				"黄石市:714",
    				"十堰市:719",
    				"宜昌市:717",
    				"襄阳市:710",
    				"随州市:722",
    				"鄂州市:711",
    				"神农架林区:725",
    				"荆门市:724",
    				"黄冈市:713",
    				"孝感市:712",
    				"咸宁市:715",
    				"荆州市:716",
    				"仙桃市:726",
    				"天门市:727",
    				"潜江市:730",
    				"恩施市:718",
    				"江汉市:728"
			);
            break;
		case "18" :
            var cityOptions = new Array(
    			    //湖南
    				"长沙市:731",
    				"株洲市:731",
    				"湘潭市:731",
    				"衡阳市:734",
    				"邵阳市:739",
    				"岳阳市:730",
    				"常德市:736",
    				"张家界市:744",
    				"益阳市:737",
    				"娄底市:738",
    				"郴州市:735",
    				"永州市:746",
    				"怀化市:745",
    				"吉首市:743"					
			);
            break;
		case "19" :
            var cityOptions = new Array(
    			    //广东
    				"广州市:200",
    				"韶关市:751",
    				"深圳市:755",
    				"珠海市:5850",
    				"汕头市:754",
    				"揭阳市:663",
    				"潮州市:768",
    				"佛山市:757",
    				"江门市:750",
    				"湛江市:759",
    				"茂名市:668",
    				"肇庆市:758",
    				"云浮市:766",
    				"惠州市:752",
    				"梅州市:753",
    				"汕尾市:660",
    			  "河源市:762",
    				"阳江市:662",
    				"清远市:763",
    				"东莞市:769",
    				"中山市:760"
				);
            break;
		case "20" :
            var cityOptions = new Array(
    			    //广西
    				"南宁市:771",
    				"崇左市:6120",
    				"柳州市:772",
    				"来宾市:6155",
    				"桂林市:773",
    				"梧州市:774",
    				"贺州市:6225",
    				"北海市:779",
    				"玉林市:775",
    				"贵港市:6242",
    				"百色市:776",
    				"河池市:778",
    			  "钦州市:777",
    				"防城港市:770"
				);
            break;
		case "21" :
            var cityOptions = new Array(
    			    //海南
    				"海口市:898",
    				"三亚市:899"
			);
            break;
		case "31" :
            var cityOptions = new Array(
    			    //重庆
    				"重庆市:230"
			);
            break;
		case "22" :
            var cityOptions = new Array(
    			    //四川
    				"成都市:280",
    				"自贡市:813",
    				"攀枝花市:812",
    				"泸州市:830",
    				"德阳市:838",
    				"绵阳市:816",
    				"广元市:839",
    				"遂宁市:825",
    				"内江市:832",
    				"资阳市:832",
    				"乐山市:833",
    				"眉山市:833",
    				"宜宾市:831",
    				"南充市:817",
    				"广安市:826",
    				"达州市:818",
    				"巴中市:827",
    				"雅安市:835",
    				"阿坝藏族羌族自治州:837",
    				"甘孜藏族自治州:836",
    				"凉山彝族自治州:834"					
			);
            break;
		case "23" :
            var cityOptions = new Array(
    			    //贵州
    				"贵阳市:851",
    				"六盘水市:858",
    				"遵义市:852",
    				"铜仁市:856",
    				"黔西南布依族苗族自治州:7070",
    				"毕节市:857",
    				"安顺市:853",
    				"黔东南苗族侗族自治州:7130",
    				"黔南布依族苗族自治州:7150"
			);
            break;
		case "24" :
            var cityOptions = new Array(
    			    //云南
    				"昆明市:871",
    				"昭通市:870",
    				"曲靖市:874",
    				"楚雄彝族自治州:878",
    				"玉溪市:877",
    				"红河哈尼族彝族自治州:873",
    				"文山壮族苗族自治州:876",
    				"普洱市:881",
    				"西双版纳傣族自治州:691",
    				"大理白族自治州:872",
    				"保山市:875",
    				"德宏傣族景颇族自治州:692",
    				"丽江市:888",
    				"怒江傈僳族自治州:886",
    				"迪庆藏族自治州:887",
    				"临沧市:883"
			);
            break;
		case "25" :
            var cityOptions = new Array(
    			    //西藏
    				"拉萨市:891",
    				"昌都地区:895",
    				"山南地区:893",
    				"日喀则地区:892",
    				"那曲地区:896",
    				"阿里地区:897",
    				"林芝地区:894"
			);
            break;
		case "26" :
            var cityOptions = new Array(
    			    //陕西
    				"西安市:290",
    				"铜川市:919",
    				"宝鸡市:917",
    				"咸阳市:290",
    				"渭南市:913",
    				"汉中市:916",
    				"安康市:915",
    				"商洛市:914",
    				"延安市:911",
    				"榆林市:912"							
			);
            break;
		case "27" :
            var cityOptions = new Array(
    			    //甘肃
    				"兰州市:931",
    				"嘉峪关市:937",
    				"金昌市:935",
    				"白银市:943",
    				"天水市:938",
    				"酒泉市:937",
    				"张掖市:936",
    				"武威市:935",
    				"定西市:932",
    				"陇南市:939",
    				"平凉市:933",
    				"庆阳市:934",
    				"临夏回族自治州:930",
    				"甘南藏族自治州:941"					
			);
            break;
		case "28" :
            var cityOptions = new Array(
    			    //青海
    				"西宁市:971",
    				"海东地区:972",
    				"海北藏族自治州:970",
    				"黄南藏族自治州:973",
    				"海南藏族自治州:974",
    				"果洛藏族自治州:975",
    				"玉树藏族自治州:976",
    				"海西蒙古族藏族自治州:977"
			);
            break;
		case "29" :
            var cityOptions = new Array(
    			    //宁夏
    				"银川市:951",
    				"石嘴山市:952",
    				"吴忠市:953",
    				"固原市:954"				
			);
            break;
		case "30" :
            var cityOptions = new Array(
    			    //新疆
    				"乌鲁木齐市:991",
    				"克拉玛依市:990",
    				"吐鲁番地区:995",
    				"哈密地区:902",
    				"昌吉回族自治州:994",
    				"博尔塔拉蒙古自治州:909",
    				"巴音郭楞蒙古自治州:992",
    				"阿克苏地区:997",
    				"克孜勒苏柯尔克孜自治州:908",
    				"喀什地区:998",
    				"和田地区:903",
    				"伊犁哈萨克自治州:999",
    				"塔城地区:901",
    				"阿勒泰地区:906",
    				"石河子市:993"
			);
            break;
	}
	document.getElementById(opn_bnk_city).options.length = 0;
    for(var i = 0; i < cityOptions.length; i++) {
    	var arr_city=cityOptions[i].split(":");
    	//alert("arr_city=" + arr_city);
		var city_code=arr_city[1];
		var city_nm=arr_city[0];
		//alert("arr_city=" + city_nm + " --> " + city_code);
        document.getElementById(opn_bnk_city).options[i]=new Option(city_nm,city_code);
        if ( document.getElementById(opn_bnk_city).options[i].value=="") {document.getElementById(opn_bnk_city).selectedIndex = i;}
  
}
}